# Introduction to Python pandas

* Do some personel readings for more markdown

In [3]:
import pandas as pd

In [31]:
data = {"apples": [3,2,0,1], "oranges":[0,3,7,2]}
data

        apples  oranges
June         3        0
Robert       2        3
Lilly        0        7
David        1        2

In [8]:
purch = pd.DataFrame(data)
purch

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [9]:
purch = pd.DataFrame(data, index=["June","Robert","Lilly","David"])
purch

        apples  oranges
June         3        0
Robert       2        3
Lilly        0        7
David        1        2

In [10]:
purch.loc["Robert"]

apples     2
oranges    3
Name: Robert, dtype: int64

In [12]:
df = pd.read_csv('data/purch.csv')
df

  Unnamed: 0   apples  oranges
0       June        3        0
1     Robert        2        3
2       Lily        0        7
3      David        1        2

In [13]:
df = pd.read_csv('data/purch.csv',index_col=0)
df

         apples  oranges
June          3        0
Robert        2        3
Lily          0        7
David         1        2

In [15]:
emp = pd.read_json('data/employee.json')
emp

            name  age      city  is_admin                 videos
0   Husnu Sensoy   39  İstanbul       1.0                    NaN
1   Kerem Kargın   25  İstanbul       NaN  [1.mp4, 2.mp4, 3.mp4]
2  İnanç Dokurel   28     İzmir       0.0                    NaN

In [16]:
import sqlite3

In [21]:
with sqlite3.connect("data/grocery.dbf") as conn:
    purch = pd.read_sql_query("select * from purch", conn)

purch

      idx  apples  oranges
0    June       3        0
1  Robert       2        3
2   Lilly       0        7
3   David       1        2

In [22]:
with sqlite3.connect("data/grocery.dbf") as conn:
    purch = pd.read_sql_query("select * from purch", conn, index_col="idx")

purch

        apples  oranges
idx
June         3        0
Robert       2        3
Lilly        0        7
David        1        2

In [30]:
with sqlite3.connect("data/grocery.dbf") as conn:
    purch = pd.read_sql_query("select * from purch", conn)

#purch.set_index("idx", inplace=True)
purch_reindexed = purch.set_index("idx")

purch_reindexed

        apples  oranges
idx
June         3        0
Robert       2        3
Lilly        0        7
David        1        2

### Writing pandas.Dataframe into targets

In [34]:
data = {"apples": [3,2,0,1], "oranges":[0,3,7,2]}
purch = pd.DataFrame(data, index=["June","Robert","Lilly","David"])
purch

        apples  oranges
June         3        0
Robert       2        3
Lilly        0        7
David        1        2

In [39]:
purch.to_csv("data/new_purchase_w_idx.csv")
purch.to_csv("data/new_purchase_wo_idx.csv",index=False)
purch.to_csv("data/new_purchase_w_idx.csv.gz") # by inference
purch.to_csv("data/new_purchase_w_idx.csv.bz2") # by inference

In [41]:
purch.to_json("data/new_purchase_o_columns.json")
purch.to_json("data/new_purchase_o_rec.json", orient='records')

In [42]:
with sqlite3.connect("data/grocery.dbf") as conn:
    purch.to_sql("new_purchase", conn)